src/cf/Catalogs/ШаблоныДвухфакторнойАутентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныДвухфакторнойАутентификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодHTTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКонтейнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФактическиеУчастники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ШаблоныДвухфакторнойАутентификации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Параметр должен быть либо статичным со строкой, либо не статичным с видом КИ
	Для Каждого СтрокаПараметр Из Параметры Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПараметр.ЗначениеПараметра) Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'У статичного параметра %1 не заполнено значение.'"),
				СтрокаПараметр.ИмяПараметра);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , 
				СтрШаблон("Параметры[%1].ЗначениеПараметра", Параметры.Индекс(СтрокаПараметр)),
				Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияДокументооборотКлиентСервер.УдалитьПустыеСтрокиТаблицы(Участники, "Участник");
	
	Справочники.ШаблоныДвухфакторнойАутентификации.ЗаполнитьДополнительныеСвойстваШаблонаИОбновитьФактическихУчастниковПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим или обновим платформенный шаблон двухфакторной аутентификации
	Справочники.ШаблоныДвухфакторнойАутентификации.СоздатьОбновитьШаблонДвухфакторнойАутентификации(ЭтотОбъект);

	// Включим 2ФА
	Справочники.ШаблоныДвухфакторнойАутентификации.Включить2ФАУчастникамШаблона(ЭтотОбъект);	

	// Для участников, которые были удалены, отключим 2ФА
	Справочники.ШаблоныДвухфакторнойАутентификации.Отключить2ФАУдаленнымУчастникам(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
